app/controllers/line_bot_controller.rb

INSERT INTO `tasks` (`body`, `created_at`, `updated_at`) VALUES ('日本ハム勝利', '2023-05-30 13:36:24.009847', '2023-05-30 13:36:24.009847')
---
  def callback

    # LINEで送られてきたメッセージのデータを取得
    body = request.body.read

    # LINE以外からリクエストが来た場合 Error を返す
    signature = request.env["HTTP_X_LINE_SIGNATURE"]
    # unless client.validate_signature(body, signature)
    #   head :bad_request and return
    # end

    # LINEで送られてきたメッセージを適切な形式に変形
    events = client.parse_events_from(body)

    events.each do |event|
      # LINE からテキストが送信された場合
      if (event.type === Line::Bot::Event::MessageType::Text)
        message = event["message"]["text"]

        # 送信されたメッセージをデータベースに保存するコードを書こう
        Task.create(body: message)