app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = NULL LIMIT 1
---
  def show
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`created_at`, `updated_at`) VALUES ('2023-05-25 13:51:26.023970', '2023-05-25 13:51:26.023970')
---
  def create
    @task = Task.new(params[:id])

    if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = NULL LIMIT 1
---
    def set_task
      @task = Task.find(params[:id])